; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	thermograph1 - mode
	spectrograph2 - mode
	spectrograph0 - mode
	infrared3 - mode
	Star0 - direction
	GroundStation2 - direction
	Star5 - direction
	GroundStation1 - direction
	Star6 - direction
	Star7 - direction
	Star4 - direction
	GroundStation3 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument1 infrared3)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 Star7)
	(supports instrument2 thermograph1)
	(supports instrument2 infrared3)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 Star4)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
	(supports instrument3 spectrograph2)
	(supports instrument3 infrared3)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 Star7)
	(calibration_target instrument3 Star5)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon8)
	(supports instrument4 spectrograph2)
	(supports instrument4 infrared3)
	(calibration_target instrument4 GroundStation3)
	(calibration_target instrument4 GroundStation1)
	(supports instrument5 spectrograph2)
	(supports instrument5 thermograph1)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 Star7)
	(calibration_target instrument5 Star6)
	(supports instrument6 infrared3)
	(supports instrument6 thermograph1)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 GroundStation3)
	(calibration_target instrument6 Star4)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star0)
)
(:goal (and
	(pointing satellite3 Star6)
	(have_image Phenomenon8 spectrograph0)
	(have_image Star9 thermograph1)
	(have_image Star10 spectrograph2)
	(have_image Phenomenon11 thermograph1)
	(have_image Planet12 spectrograph2)
))

)

; plan
1. (turn_to satellite3 star6 star0)
   deleted: (pointing satellite3 star0)
   added: (pointing satellite3 star6)
   goals met: 1 of 6
2. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 1 of 6
3. (calibrate satellite3 instrument5 star6)
   added: (calibrated instrument5)
   goals met: 1 of 6
4. (turn_to satellite3 planet12 star6)
   deleted: (pointing satellite3 star6)
   added: (pointing satellite3 planet12)
   goals met: 0 of 6
5. (take_image satellite3 planet12 instrument5 spectrograph2)
   added: (have_image planet12 spectrograph2)
   goals met: 1 of 6
6. (turn_to satellite3 phenomenon8 planet12)
   deleted: (pointing satellite3 planet12)
   added: (pointing satellite3 phenomenon8)
   goals met: 1 of 6
7. (take_image satellite3 phenomenon8 instrument5 spectrograph0)
   added: (have_image phenomenon8 spectrograph0)
   goals met: 2 of 6
8. (turn_to satellite3 phenomenon11 phenomenon8)
   deleted: (pointing satellite3 phenomenon8)
   added: (pointing satellite3 phenomenon11)
   goals met: 2 of 6
9. (take_image satellite3 phenomenon11 instrument5 thermograph1)
   added: (have_image phenomenon11 thermograph1)
   goals met: 3 of 6
10. (turn_to satellite3 star10 phenomenon11)
   deleted: (pointing satellite3 phenomenon11)
   added: (pointing satellite3 star10)
   goals met: 3 of 6
11. (take_image satellite3 star10 instrument5 spectrograph2)
   added: (have_image star10 spectrograph2)
   goals met: 4 of 6
12. (turn_to satellite3 star9 star10)
   deleted: (pointing satellite3 star10)
   added: (pointing satellite3 star9)
   goals met: 4 of 6
13. (take_image satellite3 star9 instrument5 thermograph1)
   added: (have_image star9 thermograph1)
   goals met: 5 of 6
14. (turn_to satellite3 star6 star9)
   deleted: (pointing satellite3 star9)
   added: (pointing satellite3 star6)
   goals met: 6 of 6
